Repository: shelllet/languages
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp

# EdgeLineDetection.Title
source: Find line
ja_jp: 線分検出

# EllipseDetection.Description
source: Detect a circle or ellipse in an image
ja_jp: 画像内の円または楕円の検出

# EllipseDetection.Title
source: Ellipse detection
ja_jp: 楕円検出

# CvtColor.Description
source: Color conversion
ja_jp: カラー変換

# CvtColor.Title
source: Color conversion
ja_jp: カラー変換

# ImageCanny.Description
source: Edge detection
ja_jp: エッジ検出

# ImageCanny.Title
source: Edge detection
ja_jp: エッジ検出

# ImageThreshold.Description
source: The action may perform a 2 valuing operation on the image. it can be understood as turning the image into a grayscale image according to a certain threshold condition.
ja_jp: このアクションは、画像をしきい値化することができる。このしきい値演算では、所定のしきい値よりも大きい値の画素に1つの基準値が割り当てられる。このしきい値操作はグローバルであり、つまり、画像内のすべてのピクセルが同じしきい値を使用します。

# ImageThreshold.Title
source: 2 valuing
ja_jp: しきい値

# ImageInRange.Description
source: Inrange
ja_jp: 色の範囲を指定し、映像中の色の範囲内にある色を抽出することにより、映像中の特定の色のオブジェクトを絞り込むことができる。

# ImageInRange.Title
source: Inrange
ja_jp: カラーフィルタ

# MoveDoubleClick.Description
source: Image corrosion
ja_jp: マウスを移動し、マウスの適切なキーをダブルクリックします

# MoveDoubleClick.Title
source: Corrosion
ja_jp: 移動してダブルクリック

# ConnectedComponents.Description
source: Connected components
ja_jp: 二値画像中のbolb（スポット）領域の連結性を解析することにより、二値画像中のスポットをより細かい粒度でフィルタリングすることができる。

# ConnectedComponents.Title
source: Connected components
ja_jp: れんらくたいかいせき

# ImageBlur.Description
source: Fuzzy
ja_jp: ぼやける

# ImageBlur.Title
source: Fuzzy
ja_jp: ぼやける

# ApproxPolyDP.Description
source: Approxpolydp
ja_jp: 形状の輪郭間の距離が所定の精度以下になるように、ある輪郭の形状を他の頂点の数が少ない形状に近似することを、形状の近似輪郭と呼ぶ

# ApproxPolyDP.Title
source: Approxpolydp
ja_jp: 近似輪郭

# FindNonZero.Description
source: On a picture, look for non-zero pixels.
ja_jp: 画像上で、0以外のピクセル位置を探します。

# FindNonZero.Title
source: Non-zero pixel point
ja_jp: ゼロ以外のピクセル点

# WorkThread.Description
source: Threads can be used to perform some actions asynchronously.
ja_jp: スレッドを使用して、いくつかのアクションを非同期で実行できます。

# WorkThread.Title
source: Thread
ja_jp: スレッド

# SetForegroundWindow.Description
source: Front window
ja_jp: 前面ウィンドウの設定

# SetForegroundWindow.Title
source: Front window
ja_jp: 前面ウィンドウ

# ShutdownSystem.Description
source: This action can shut down the operating system, that is, the computer shuts down.
ja_jp: この動作でosをシャットダウン、つまりパソコンをシャットダウンすることができます。

# ShutdownSystem.Title
source: Shutdown
ja_jp: シャットダウン

# TimedTask.Description
source: The action is triggered at a specified time and the corresponding sub-actions can be executed.
ja_jp: アクションは、指定された時間にトリガされ、対応するサブアクションを実行することができる。

# TimedTask.Title
source: Scheduled tasks
ja_jp: ていじタスク

# HttpPost.Description
source: Send http post request
ja_jp: Httpベースのポスト要求

# HttpPost.Title
source: Post
ja_jp: ポスト

# HttpHead.Description
source: Http head request
ja_jp: Httpベースのhead要求

# HttpHead.Title
source: Head
ja_jp: ヘド

# Android.Description
source: Android
ja_jp: アンドロイド

# Android.Title
source: Android
ja_jp: アンドロイド

# AdbKillServer.Description
source: Termination of service
ja_jp: Androidエミュレータサービスを終了し、プロセスadb.exeを終了します。

# AdbKillServer.Title
source: Termination of service
ja_jp: サービスの終了

# AdbDevices.Description
source: Query the android emulator already started in the system.
ja_jp: システムで起動しているandroidエミュレータを確認します。

# AdbDevices.Title
source: Equipment list
ja_jp: ユニット・リスト

# AdbStartServer.Description
source: Start service
ja_jp: Adbサービスの開始

# AdbStartServer.Title
source: Start service
ja_jp: サービスの開始

# AdbForward.Description
source: Map android ports to local ports.
ja_jp: アンドロイドのポートをローカルポートにマッピングします。

# AdbForward.Title
source: Forwarding
ja_jp: 転送

# AdbConnect.Description
source: The main application in the simulator is not on this machine, but on another computer.
ja_jp: 接続シミュレータは、主にシミュレータが遠隔地にあるコンピュータ上で利用される。

# AdbConnect.Title
source: Connection
ja_jp: 接続

# AdbIfConfig.Description
source: View nic configuration
ja_jp: エミュレータのnic構成の表示

# AdbIfConfig.Title
source: View nic configuration
ja_jp: Nic構成の表示

# AdbRemoveForward.Description
source: Remove port forwarding in the current system.
ja_jp: 現在のシステムからポート転送を削除します。

# AdbRemoveForward.Title
source: Remove forwarding
ja_jp: 転送の削除

# ReadLines.Description
source: Read multi-line file
ja_jp: 複数行ファイルの読み込み

# ReadLines.Title
source: Read multi-line file
ja_jp: 複数行ファイルの読み込み

# AdbSwipe.Description
source: Sliding operation is realized in android simulator.
ja_jp: アンドロイドエミュレータではスワイプ操作を実現している。

# AdbSwipe.Title
source: Slide
ja_jp: すべり

# AdbInput.Description
source: Simulate input text in the android simulator, this action does not support chinese input.
ja_jp: Androidエミュレータでテキスト入力をシミュレートしますが、この動作は中国語入力には対応していません。

# AdbInput.Title
source: Input
ja_jp: 入力

# AdbKey.Description
source: Simulate keystrokes in the android simulator.
ja_jp: Androidエミュレータでキーをエミュレートします。

# AdbKey.Title
source: Key
ja_jp: キー

# AdbTap.Description
source: Simulate a click in the android simulator.
ja_jp: Androidエミュレータでクリックをシミュレートします。

# AdbTap.Title
source: Click
ja_jp: クリック

# AdbScreenCap.Description
source: Simulator screenshots.
ja_jp: エミュレータのスクリーンショット。

# AdbScreenCap.Title
source: Screenshot
ja_jp: スクリーンショット

# AccessArray.Description
source: Gets the value in an action based on the index. this action must have multiple identical values.
ja_jp: インデックスに基づいて配列の値を取得します。

# AccessArray.Title
source: Access array
ja_jp: インデックス*配列

# BaiduTranslate.Description
source: Baidu translation
ja_jp: 百度翻訳

# BaiduTranslate.Title
source: Baidu translation
ja_jp: 百度翻訳

# AdbStartApp.Description
source: This action can open the app on the android simulator.
ja_jp: この動作でandroidエミュレータ上のappを開くことができます。

# AdbStartApp.Title
source: Open app
ja_jp: Appを開く

# AccessKey.Description
source: Gets the value of the object based on the specified name
ja_jp: 指定した名前に基づいて、オブジェクトの値を取得します。

# AccessKey.Title
source: Access key
ja_jp: 名前*オブジェクト

# CaptureForground.Description
source: Front window screenshot
ja_jp: フロントウィンドウのスクリーンショット。

# CaptureForground.Title
source: Front window screenshot
ja_jp: 前面ウィンドウのスクリーンショット

# Cloud.Description
source: Cloud
ja_jp: クラウド

# Cloud.Title
source: Cloud
ja_jp: クラウド

# XmlLoadDocument.Description
source: Xmlloaddocument
ja_jp: Xmlドキュメント

# XmlLoadDocument.Title
source: Xmlloaddocument
ja_jp: ドキュメント

# Json.Description
source: Json
ja_jp: ジェイソン

# Json.Title
source: Json
ja_jp: ジェイソン

# XmlGetNodeList.Description
source: Xmlgetnodelist
ja_jp: Xmlノードの取得

# XmlGetNodeList.Title
source: Xmlgetnodelist
ja_jp: ノードの取得

# XmlNodeName.Description
source: Xmlnodename
ja_jp: Xmlノード名

# XmlNodeName.Title
source: Xmlnodename
ja_jp: ノード名

# FilterText.Description
source: The action can filter an array containing strings
ja_jp: このアクションは、テキストエレメントを含むリストをフィルタリングします。

# FilterText.Title
source: Filter string
ja_jp: テキストのフィルタリング

# XmlDocumentElement.Description
source: Xmldocumentelement
ja_jp: Xmlドキュメント要素

# XmlDocumentElement.Title
source: Xmldocumentelement
ja_jp: 要素

# XmlReplaceText.Description
source: Xmlreplacetext
ja_jp: ノードテキストの置き換え(replace node text)

# XmlReplaceText.Title
source: Xmlreplacetext
ja_jp: テキスト置換

# XmlSaveDocument.Description
source: Save xml file
ja_jp: Xmlファイルを保存

# XmlSaveDocument.Title
source: Save
ja_jp: 保存

# InputFlyoutItem.Actions.Text
source: Action
ja_jp: 動作

# InputFlyoutItem.Expression.Text
source: Expression
ja_jp: 式

# InputFlyoutItem.Text.Text
source: Text
ja_jp: テキスト

# InputFlyoutItem.Url.Text
source: Website
ja_jp: ウェブアドレス

# InputFlyoutItem.Boolean.Text
source: Boolean
ja_jp: ブール演算

# InputFlyoutItem.Number.Text
source: Numbers
ja_jp: 数字

# InputFlyoutItem.Point.Text
source: Coordinates
ja_jp: 座標

# InputFlyoutItem.FolderPicker.Text
source: Folder
ja_jp: フォルダ

# InputFlyoutItem.FilePicker.Text
source: File
ja_jp: ファイル

# InputFlyoutItem.KeySequence.Text
source: Keyboard
ja_jp: キーボード

# InputFlyoutItem.Resource.Text
source: Resources
ja_jp: リソース

# InputFlyoutItem.Scalar.Text
source: Scalar
ja_jp: スカラ

# InputFlyoutItem.Range.Text
source: Scope
ja_jp: 範囲

# InputFlyoutItem.Color.Text
source: Color
ja_jp: 色

# InputFlyoutItem.Rect.Text
source: Rectangle
ja_jp: 長方形

# ProcessID.Description
source: Processes can be executed concurrently, and when they are executed concurrently, multiple processes are started, and each running process has a unique numeric flag that increments from 0.
ja_jp: プロセスは同時に実行できます。同時に実行すると、複数のプロセスが起動されます。実行中の各プロセスには、0から増分する一意の数値フラグが付けられます。

# ProcessID.Title
source: Process flag
ja_jp: プロセスフラグ

# PaddleTextDirectionClassifier.Description
source: Text direction classification
ja_jp: テキスト方向分類

# PaddleTextDirectionClassifier.Title
source: Text direction classification
ja_jp: テキスト方向分類

# InputParam.Description
source: The value passed in by the parent action.
ja_jp: 通常は子アクションとして、その値は対応する親アクションから渡されます。通常、リストはサブアクションをサポートし、リストの各要素がサブアクションに渡されます。

# InputParam.Title
source: Incoming parameters
ja_jp: 入力パラメータ

# WebActionChainsPerform.Description
source: Execute the created action chain.
ja_jp: 作成したアクションチェーンを実行します。

# WebActionChainsPerform.Title
source: Action chain * execution
ja_jp: アクションチェーン*実行

# WebElementSendKey.Description
source: Send button
ja_jp: 送信キー

# WebElementSendKey.Title
source: Send button
ja_jp: 送信キー

# WebElementClick.Description
source: Click
ja_jp: クリック

# WebElementClick.Title
source: Click
ja_jp: クリック

# WebElementClear.Description
source: Clears the text if it is a text input element.
ja_jp: テキストがテキスト入力エレメントの場合は、テキストを消去します。

# WebElementClear.Title
source: Clear text
ja_jp: テキストをクリア

# WebElementIsSelect.Description
source: Returns whether the element is selected, which can be used to check whether a check box or radio button is selected.
ja_jp: 要素が選択されているかどうかを返します。チェックボックスまたはラジオボタンが選択されているかどうかを確認できます。

# WebElementIsSelect.Title
source: Check selected
ja_jp: チェックを選択

# WebElementSendText.Description
source: Sends text to the currently focused web element.
ja_jp: 現在フォーカスがあるwebエレメントにテキストを送信します。

# WebElementSendText.Title
source: Send text
ja_jp: テキストの送信

# WebActionClickHold.Description
source: Hold down the left mouse button on the element, this action needs to be added to the action chain.
ja_jp: エレメント上でマウスの左ボタンを押したままにすると、このアクションはアクションチェーンに追加されます。

# WebActionClickHold.Title
source: Action chain. tap
ja_jp: アクションチェーン点押し

# WebActionDoubleClick.Description
source: Double-click an element and this action needs to be added to the action chain.
ja_jp: 要素をダブルクリックすると、そのアクションはアクションチェーンに追加されます。

# WebActionDoubleClick.Title
source: Action chain. double click
ja_jp: アクションチェーン、ダブルクリック

# WebActionMoveTo.Description
source: Move the mouse over the element.
ja_jp: 要素の上にマウスを移動します。

# WebActionMoveTo.Title
source: Action chain. move
ja_jp: アクションチェーン

# WebActionRelease.Description
source: Release the mouse button held down on the element.
ja_jp: エレメントの上にあるマウスボタンを放します。

# WebActionRelease.Title
source: Action chain. release
ja_jp: アクションチェーン

# WebActionDragDrop.Description
source: Hold down the left mouse button on the source element, then move to the target element and release the mouse.
ja_jp: ソース要素上でマウスの左ボタンを押したまま、ターゲット要素に移動してマウスを放します。

# WebActionDragDrop.Title
source: Action chain. drag and drop
ja_jp: アクションチェーン：ドラッグ&ドロップ

# WebActionKeyDown.Description
source: Only the key is sent, not released. can be used only with (control, alt, and shift).
ja_jp: キーを送信するだけで、解除しません。(control、alt、shift)でのみ使用できます。

# WebActionKeyDown.Title
source: Action chain. key
ja_jp: アクションチェーン

# WebActionKeyUp.Description
source: Release modifier key
ja_jp: 変更キーの解除

# WebActionKeyUp.Title
source: Action chain. release key
ja_jp: アクションチェーン.キーを離す

# WebActionMoveOffset.Description
source: Moves the mouse to the offset of the current mouse position or the specified web element.
ja_jp: 現在のマウス位置にマウスを移動するか、webエレメントのオフセットを指定します。

# WebActionMoveOffset.Title
source: Action chain. move (offset)
ja_jp: アクションチェーン：移動(オフセット)いどうチェーン

# WebActionSendText.Description
source: Set text
ja_jp: テキストの設定

# WebActionSendText.Title
source: Action chain. send text
ja_jp: アクションチェーン：テキストの送信

# LoggingEnabled.Description
source: This action is used to individually control the output log
ja_jp: このアクションは出力ログを個別に制御するために使用されます

# LoggingEnabled.Title
source: Output
ja_jp: アウトプット

# AdaptiveThreshold.Description
source: Adaptive 2 valuing
ja_jp: [適応しきい値]は、小さい領域に対してしきい値を計算するため、領域ごとにしきい値が異なります。

# AdaptiveThreshold.Title
source: Adaptive 2 valuing
ja_jp: てきおうしきい値

# GroupAction.Description
source: This action can group related actions on the view, which is more logical.
ja_jp: このアクションは、ビュー上の関連するアクションをグループ化し、論理をより明確にすることができます。

# GroupAction.Title
source: Grouping
ja_jp: グループ分け

# AdbMove.Description
source: Move
ja_jp: 上下左右に移動する、ゲームにおけるwasdのような機能。

# AdbMove.Title
source: Move
ja_jp: 移動

# TcpListen.Description
source: This action is used to create a tcp or udp server.
ja_jp: このアクションは、tcpまたはudpサービス側を作成するために使用されます。

# TcpListen.Title
source: Listening
ja_jp: 傍受

# TcpSend.Description
source: This action sends data over tcp or udp.
ja_jp: この動作は、tcpまたはudpを介してデータを送信する。

# TcpSend.Title
source: Send
ja_jp: 送信

# TcpReceive.Description
source: This action receives data over tcp or udp.
ja_jp: この動作は、tcpまたはudpを介してデータを受信する。

# TcpReceive.Title
source: Receive
ja_jp: じゅしん

# TcpConnect.Description
source: This action connects to the server via tcp or udp.
ja_jp: この動作は、tcpまたはudpを介してサービス側に接続する。

# TcpConnect.Title
source: Connection
ja_jp: 接続

# FilterArea.Description
source: Area filtration
ja_jp: 配列内の要素の面積を計算することによる要素のフィルタリング

# FilterArea.Title
source: Area filtration
ja_jp: めんせきろか

# FilterPerimeter.Description
source: Filterperimeter
ja_jp: ファイターペリメーター

# FilterPerimeter.Title
source: Filterperimeter
ja_jp: ファイターペリメーター

# ColorPercentage.Description
source: This action can count the proportion of a 1 color in the image.
ja_jp: このアクションは、画像内のカラーの割合をカウントします

# ColorPercentage.Title
source: Color statistics
ja_jp: カラー統計(color statistics)

# WindowVisible.Description
source: This action is used to set the window to show or hide.
ja_jp: このアクションは、ウィンドウの表示/非表示を設定します。

# WindowVisible.Title
source: Window visible
ja_jp: ウィンドウ表示

# TypeColor.Description
source: Color
ja_jp: 色

# TypeColor.Title
source: Color
ja_jp: 色

# DrawDetectResults.Description
source: Draw object detection results
ja_jp: 描画オブジェクトの検出結果

# DrawDetectResults.Title
source: Tag object
ja_jp: オブジェクトにタグを付ける

# FilterEllipse.Description
source: The action can filter the ellipses detected by the ellipse detection action
ja_jp: 楕円の特性によって円または楕円をフィルタします。

# FilterEllipse.Title
source: Elliptical filtering
ja_jp: 楕円フィルタリング

# CloseHandle.Description
source: Close the handle opened by the application degree.
ja_jp: 適用レベルオンのハンドルをオフにする

# CloseHandle.Title
source: Close handle
ja_jp: ハンドルを閉じる

# Empty.Description
source: Empty
ja_jp: エンプティ

# Empty.Title
source: Empty
ja_jp: エンプティ

# EnumWindows.Description
source: Enumeration window
ja_jp: 列挙ウィンドウ

# EnumWindows.Title
source: Enumeration window
ja_jp: 列挙ウィンドウ

# FilterWindows.Description
source: Window filtering
ja_jp: ウィンドウのフィルタリング

# Workflow.MenuItem.Add.Text
source: Add
ja_jp: 追加

# Workflow.MenuItem.Copy.Text
source: Copy
ja_jp: コピー

# Workflow.MenuItem.Locate.Text
source: Positioning
ja_jp: ポジショニング

# MatchTemplate.Description
source: Simple picture search, suitable for scenes with fixed pixels
ja_jp: 簡単な画像検索。通常は、より小さい画像を検索するために使用されます。

# MatchTemplate.Title
source: Template matching
ja_jp: テンプレートマッチング

# RelationalOperator.Description
source: The relational operation is used to compare two operand values, and the relational operation returns a boolean value, that is, true or false, depending on the value of the operand.
ja_jp: リレーショナル演算は、2つのオペランドの値を比較するために使用されます。リレーショナル演算は、オペランドの値に基づいてtrueまたはfalseを返すブール値を返します。

# RelationalOperator.Title
source: Relational operation
ja_jp: かんけいえんざん

# ImageMarkROI.Description
source: Mark the area of interest in the picture, for example, when looking for a picture, only find the picture from this area.
ja_jp: 画像を探す際に、画像の関心のある領域を特定し、その領域からのみ画像を検索することができるようにする。

# ImageMarkROI.Title
source: Mark roi
ja_jp: Roiのタグ付け

# TypeString.Description
source: Defines a string
ja_jp: 文字列の定義

# TypeString.Title
source: String
ja_jp: 文字列
